Курс "Основы программирования C++"
Тема: Указатели. Динамические массивы


Задания для самостоятельной работы.


13) Запросить у пользователя размерность для одномерного массива вещественных чисел.
Динамически создать такой массив и заполнить его случайными числами в диапазоне от 0 до 1. 

15) ***Пользуясь указателем на массив целых чисел, посчитать количество и процент простых элементов в массиве.
Размер массива вводиться пользователем, а элементы массива заполняются случайным образом в заданном диапазоне.
Примечание. Простое число – это число, которое делиться ТОЛЬКО на 1 и на себя (2, 5, 7, 11 и т.д.). 

16) ***Написать функцию, которая принимает указатель на массив и количество элементов и формирует новый массив минимально возможного размера,
куда сохраняет все простые элементы массива.
Функция возвращает указатель на этот новый массив.
Рекомендации: Сначала посчитайте количество простых элементов в массиве, потом уже создайте новый массив и занесите туда эти числа. 


17) Написать функцию, которая принимает указатель на массив и количество элементов.
Функция сжимает массив, удаляя из него элементы равные 0.
a**) Возвращает указатель на новый массив, не содержащий 0. 
b***) Функция сжимает оригинальный массив (который передан параметром)


18) Написать функцию, которая принимает указатель на массив и количество элементов.
Функция сжимает массив, удаляя из него элементы НЕ кратные трем (не делятся на 3).
a**) Возвращает указатель на новый массив, содержащий только числа кратные трем. 
b***) Функция сжимает оригинальный массив (который передан параметром)


19) **Написать программу, которая вычисляет сумму элементов массива, используя ДВА указателя на массив целых чисел.
Первый указатель двигается с начала массива, второй – с конца. 


20) **Написать функцию, которая принимает указатель на массив и количество элементов.
Пользуясь ДВУМЯ указателями на массив целых чисел, функция должна поменять порядок элементов передаваемого ей массива на обратный. 


------------------------------------------------
1) Исправить код:
#include <iostream>
using namespace std;
void main()
{
 int a=2, b=5;
 int *p1, *p2=&b;
 *p1=10;
 cout<<*p1-*p2;
}

2) Исправить код:
#include <iostream>
using namespace std;
void main()
{
 double a=2.5, b=5.2, res;
 int *p1=a, p2=b;
 res=*p1-p2;
 cout<<res;
}

3) Исправить код: 
#include <iostream>
using namespace std;
#define SIZE 10
void main()
{
 int A[SIZE]={1,2,3,4,5,6,7,8,9,10};
 int *p=A;
 for(int i=0; i<SIZE; i++) //выполнить вывод массива используя указатели
  cout << *A++;
}

4) Для кода:
#include <iostream>
using namespace std;
void main()
{
 int a=2;
 int *p=&a;
 //Объяснить, в чём заключается разница между операциями
 (*p)++;
 //и
 *p++;
} 

